Autodesk.Revit.DB.CopyPasteOptions.SetDuplicateTypeNamesHandler(Autodesk.Revit.DB.IDuplicateTypeNamesHandler)
Sets a custom duplicate type names handler. If this value is not set, the default handler is used.
By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation.
handler:
The duplicate type names handler.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.CopyPasteOptions.GetDuplicateTypeNamesHandler
Returns current duplicate type names handler or null if none is set.
Since:
2014

Autodesk.Revit.DB.CopyPasteOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CopyPasteOptions.#ctor
Creates a new instance of a CopyPasteOptions object.
Since:
2014

Autodesk.Revit.DB.CopyPasteOptions
Settings to control the behavior of a copy-paste operation.
Since:
2014